In [3]:
import pandas as pd
 
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18],
        'test':[23,54,45,78]}
 
df = pd.DataFrame(data)
 
print(df)

    Name  Age  test
0    Tom   20    23
1   nick   21    54
2  krish   19    45
3   jack   18    78

In [5]:
import pandas as pd
 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
df = pd.DataFrame(data)
 
print(df[['Name', 'Qualification','Age']])

     Name Qualification  Age
0     Jai           Msc   27
1  Princi            MA   24
2  Gaurav           MCA   22
3    Anuj           Phd   32

In [1]:
import pandas as pd
 
data = pd.read_csv("nba.csv", index_col="Name")
second = data.loc["25"]
 
print("\n\n\n", second)

KeyError: '25'

In [14]:
import pandas as pd
 
data = pd.read_csv("nba.csv", index_col ="Name")

first = data["Age"]
 
print(first)

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [6]:
import pandas as pd
std_data=[(1,'varun',24,'male','nashik'),
           (2,'ravi',19,'male','dehli'),
           (3,'preeto',24,'female','jaipur'),
           (4,'amit',20,'male','banglore'),
           (5,'pinki',25,'female','mumbai')]
df=pd.DataFrame(std_data,columns=['stud_id','name','age','gender','city'])
df

   stud_id    name  age  gender      city
0        1   varun   24    male    nashik
1        2    ravi   19    male     dehli
2        3  preeto   24  female    jaipur
3        4    amit   20    male  banglore
4        5   pinki   25  female    mumbai

In [60]:
df=pd.read_csv("student.csv")
df

   index column1  age    name
0      1      fg    3    amit
1      2      fg    5    ravi
2      3     sfg    8   anmol
3      4     sfg    5  sunder
4      5    sdfg    5   rashi
5      6     sfg    5  maheer
6      7     sfg    7   aryan
7      8      fg    8    yash

In [8]:
df.head(2)

  lk;ll  dfg    sfg
0    fg  fgs   fdgs
1    fg  fgs  dfgsd

In [9]:
df.tail(1)

  lk;ll  dfg  sfg
7    fg  fgs  NaN

In [10]:
df.shape

(8, 3)

In [11]:
df.columns

Index(['lk;ll', 'dfg', 'sfg'], dtype='object')

In [15]:
df['dfg']

0     fgs
1     fgs
2    sfgs
3    sfgs
4    sfgs
5    sfgs
6    sfgs
7     fgs
Name: dfg, dtype: object

In [16]:
df.size

24

In [18]:
df.dtypes

lk;ll    object
dfg      object
sfg      object
dtype: object

In [24]:
df.values

array([['fg', 3, 'amit'],
       ['fg', 5, 'ravi'],
       ['sfg', 8, 'anmol'],
       ['sfg', 5, 'sunder'],
       ['sdfg', 5, 'rashi'],
       ['sfg', 5, 'maheer'],
       ['sfg', 7, 'aryan'],
       ['fg', 8, 'yash']], dtype=object)

In [20]:
df.index

RangeIndex(start=0, stop=8, step=1)

# selecting row and column

In [26]:
df['age']

0    3
1    5
2    8
3    5
4    5
5    5
6    7
7    8
Name: age, dtype: int64

# row by indexm

In [29]:
df.loc[1]

column1      fg
age           5
name       ravi
Name: 1, dtype: object

In [31]:
df.iloc[2]

column1      sfg
age            8
name       anmol
Name: 2, dtype: object

In [39]:
df.iloc[[0,7]]

   index column1  age  name
0      1      fg    3  amit
7      8      fg    8  yash

# filtering rowm

In [40]:
df[df['age'] > 3]

   index column1  age    name
1      2      fg    5    ravi
2      3     sfg    8   anmol
3      4     sfg    5  sunder
4      5    sdfg    5   rashi
5      6     sfg    5  maheer
6      7     sfg    7   aryan
7      8      fg    8    yash

# adding a new column

In [44]:
df['phone_no']=[10,20,30,40,50,60,70,80]
df

   index column1  age    name  phone_no
0      1      fg    3    amit        10
1      2      fg    5    ravi        20
2      3     sfg    8   anmol        30
3      4     sfg    5  sunder        40
4      5    sdfg    5   rashi        50
5      6     sfg    5  maheer        60
6      7     sfg    7   aryan        70
7      8      fg    8    yash        80

In [54]:
df.insert(3,'phone_no',[10,20,30,40,50,60,70,80])
print(df)

   index column1  student_age  phone_no    name
0      1      fg            3        10    amit
1      2      fg            5        20    ravi
2      3     sfg            8        30   anmol
3      4     sfg            5        40  sunder
4      5    sdfg            5        50   rashi
5      6     sfg            5        60  maheer
6      7     sfg            7        70   aryan
7      8      fg            8        80    yash

In [52]:
df = df.drop(columns=['phone_no'])
df 
#delete

   index column1  student_age    name
0      1      fg            3    amit
1      2      fg            5    ravi
2      3     sfg            8   anmol
3      4     sfg            5  sunder
4      5    sdfg            5   rashi
5      6     sfg            5  maheer
6      7     sfg            7   aryan
7      8      fg            8    yash

In [49]:
df=df.rename(columns={'age':'student_age'})
df #rename

   index column1  student_age    name
0      1      fg            3    amit
1      2      fg            5    ravi
2      3     sfg            8   anmol
3      4     sfg            5  sunder
4      5    sdfg            5   rashi
5      6     sfg            5  maheer
6      7     sfg            7   aryan
7      8      fg            8    yash

In [55]:
del df['phone_no']
df

   index column1  student_age    name
0      1      fg            3    amit
1      2      fg            5    ravi
2      3     sfg            8   anmol
3      4     sfg            5  sunder
4      5    sdfg            5   rashi
5      6     sfg            5  maheer
6      7     sfg            7   aryan
7      8      fg            8    yash

In [58]:
df = df.drop(3)
df

   index column1  student_age    name
0      1      fg            3    amit
1      2      fg            5    ravi
4      5    sdfg            5   rashi
5      6     sfg            5  maheer
6      7     sfg            7   aryan
7      8      fg            8    yash

In [63]:
df.loc[4] = [4,'dg',6,'pinki']

In [64]:
df

   index column1  age    name
0      1      fg    3    amit
1      2      fg    5    ravi
2      3     sfg    8   anmol
3      4     sfg    5  sunder
4      4      dg    6   pinki
5      6     sfg    5  maheer
6      7     sfg    7   aryan
7      8      fg    8    yash

In [65]:
df.loc[2,'age']=8
df

   index column1  age    name
0      1      fg    3    amit
1      2      fg    5    ravi
2      3     sfg    8   anmol
3      4     sfg    5  sunder
4      4      dg    6   pinki
5      6     sfg    5  maheer
6      7     sfg    7   aryan
7      8      fg    8    yash

# updating multiple value

In [67]:
df.loc[[0,2],'age']=89
df

   index column1  age    name
0      1      fg   89    amit
1      2      fg    5    ravi
2      3     sfg   89   anmol
3      4     sfg    5  sunder
4      4      dg    6   pinki
5      6     sfg    5  maheer
6      7     sfg    7   aryan
7      8      fg    8    yash